//
//  CoverImage.swift
//  hw2
//
//  Created by User02 on 2019/10/18.
//  Copyright © 2019 User02. All rights reserved.
//

import Foundation
let images = [image(name: "第一封面", gameName: "惡魔獵人", guide:                    "在1999年，卡普空推出《惡靈古堡3：復仇女神》後，曾擔任《惡靈古堡2》遊戲監督的神谷英樹預備開發最新作《惡靈古堡4》，公司內部同時打算推出惡靈古堡系列外傳遊戲《惡靈古堡：聖女密碼》，並交由SEGA屬下Nextech Corporation研發。於是遊戲開發人員去到歐洲的西班牙搜查各種各樣的城堡來設計遊戲的環境。神谷英樹所開發的《惡靈古堡4》出來的時候，卡普空意識到初版在各方面都與以往惡靈古堡系列的恐怖風格大有不同，於是開創一個名為「惡魔獵人（Devil May Cry）」的遊戲系列。雖然惡魔獵人系列幾乎所有角色都是新的，但一些怪物與以往惡靈古堡系列的怪物十分相似，例如裝甲的怪物「刀怪」，與惡靈古堡相似。Kyklops與其它惡靈古堡系列中變大化蜘蛛相似。《惡魔獵人》推出後如此受玩家歡迎，因為它的風格回歸到近似80年代末至90年代初期的2D遊戲風格，同時遊戲加入了3D效果以及一些創新風格、故事線、絕妙的電影配樂這些遊戲元素，並且帶有惡魔城的風格，惡魔獵人系列便成為獨當一面的遊戲。"),
              image(name: "第二封面", gameName: "惡魔獵人2", guide: "由於前作《惡魔獵人》取得空前的成功，故卡普空隨即宣布開發續作。卡普空與卡普空第四開發部的神谷英樹意見不合，《惡魔獵人2》便交由卡普空第一開發部負責，由伊津野英昭擔當遊戲監督，田中剛擔任遊戲製作人。"),
              image(name: "第三封面", gameName: "惡魔獵人3", guide: "《惡魔獵人2》發售後，由於口碑未如理想，卡普空決定以回歸《惡魔獵人》為重點，開發系列續作《惡魔獵人3》。《惡魔獵人3》於2005年3月1日在PlayStation 2發售，取得極高的評價，重新將「惡魔獵人系列」推上高峰。"),
              image(name: "第四封面", gameName: "惡魔獵人3 Special Edition", guide: "《Devil May Cry 3 Special Edition》只作為類似「外傳」形式出現，但遊戲系統將延續《Devil May Cry 3》，在原來的基礎上追加了VERY HARD難度，而滿足一定條件則能使用維吉爾，其武器以及特殊技能將沒有但丁那樣豐富，但同樣可以變身為魔人，可使用的武器為 閻魔刀、Force edge、Beowulf、幻影劍4種，相對與前作來說，本作只以交代劇情為主。"),
              image(name: "第五封面", gameName: "惡魔獵人4", guide: "2005年舉行的E3電玩展中，卡普空公司展示了一段以但丁（Dante）為主角的短片，片段中的但丁以快速移動及靈敏身手展示了惡魔獵人系列續作的初步構思。在2006年東京電玩展上，《惡魔獵人4》正式對外發布，遊戲預定於PlayStation 3上開發，場內展示了多段相關的遊戲片段，但是遊戲主角已經換上全新角色尼祿（Nero）。2007年3月19日，卡普空宣布《惡魔獵人4》將會同時推出Xbox 360及PC版本，否定了是PlayStation 3獨佔的遊戲。其後日本電玩通（Famitsu）雜誌訪問遊戲製作人小林裕幸得知，但丁（Dante）不只會是《惡魔獵人4》其中一個可以操控角色，而是整個故事之中的第二個主角，玩家將會透過尼祿來了解但丁的動機與真意。同時小林表示PlayStation 3版本跟Xbox 360版本的內容將會完全相同。"),
              image(name: "第六封面", gameName: "惡魔獵人 HD Collection", guide: "PS3、Xbox 360，2012年3月22日發售"),
              image(name: "第七封面", gameName: "惡魔獵人4 Special Edition", guide: "《惡魔獵人 4 特別版》是 2008 年在 PS3 / Xbox 360 上推出的《惡魔獵人 4》的新世代主機強化移植版，除了畫面解析度提高至 1080p 之外，還收錄許多原本所沒有的額外內容，3 名新的玩家操作角色，總計將有 5 名玩家操作角色可以選擇，是系列之最。"),
              image(name: "第八封面", gameName: "惡魔獵人 HD Collection", guide: "PS4、Xbox One、Steam，2018年3月15日發售"),
              image(name: "第九封面", gameName: "惡魔獵人5", guide: "是一款由卡普空開發並發行在PlayStation 4、Xbox One和Microsoft Windows的動作冒險遊戲。本作是《惡魔獵人系列》時隔10年公布的正統第五代，也是繼2013年的《DmC：惡魔獵人》後的最新作，還是系列繼《惡魔獵人2》之後再次支援中文內容，包括繁簡中文。遊戲於2018年E3展的微軟展前發表會上正式公布，定於2019年3月8日發售。但丁和尼祿以可玩角色的身份回歸。此外，還有一名叫做「V」的可玩角色")]
