//
//  File.swift
//  hw2
//
//  Created by User02 on 2019/10/18.
//  Copyright © 2019 User02. All rights reserved.
//

import Foundation
let 但丁 = [CerData(name: "但丁", data: "特徵是有著高大的身型以及銀白色頭髮，經常身穿正紅色的大衣，其性格狂放不羈，在戰鬥時喜歡嘲諷敵人。由於但丁的母親伊娃（Eva）為人類，而父親斯巴達（Sparda）為惡魔，故但丁具有「半人半魔」的身分，而但丁與他的兄弟維吉爾（Vergil）是雙胞胎。")]
let 維吉爾 = [CerData(name: "維吉爾", data: "但丁的雙胞胎哥哥，同樣是半人半魔，但性格跟但丁完全相反，冷酷少語，是絕對力量主義者，為此苦尋父親留下的最強武器-魔劍斯巴達。主要特徵為銀白頭髮和藍色大衣，平常髮型是後背頭似乎是為了跟但丁做區分，因為頭髮放下來後跟但丁長的一模一樣。使用武器為武士刀，名為「閻魔刀（Yamato）」，是其父斯巴達留給他的遺物。小時候親眼目睹自己的母親伊娃在自己的面前被殺，因而認定是自己過於弱小導致無法拯救她，這使他往後沉醉於獲取更多力量來增強自己的實力。")]
let 尼祿 = [CerData(name: "尼祿", data: "魔劍教團是要塞城市「佛圖納」（Fortuna）的宗教組織，崇拜挺身為人類對抗魔界大軍的斯巴達（Sparda，即但丁之父）。尼祿則是魔劍教團的武裝部隊「聖騎士」成員之一。擁有著「惡魔右手」的強大威力。他配備是大劍「紅皇后」（Red Queen）和手槍「藍玫瑰」（Blue Rose），遇上但丁後，逐漸發現自己周遭的真相，與但丁等人聯手解決魔劍教團事件。官方小説版說明尼祿正是維吉爾的兒子，是人類與混血惡魔的混血兒，但該小說沒有提及何時誕下尼祿。在《惡魔獵人5》裡，繼承叔父但丁的狩獵惡魔之事業，但右手被維吉爾砍下並奪走，安裝了妮可製造的特製義肢「破魔者」，故事後期重生新的右手但還可以繼續使用破魔者。")]
let 翠絲 = [CerData(name: "翠絲", data: "《惡魔獵人》的女主角。名字源自於《神曲》中但丁一生單相思的戀人貝緹麗彩。故事中的設定為被魔帝製造成跟但丁的母親有著一模一樣的容貌，身分不明的惡魔去委託但丁。武器是雙槍，還有可以放出雷電的能力。故事之後成為但丁的搭擋，但常會不知去向，四代中曾拿著但丁的魔具「魔劍斯巴達」作為引誘魔劍教團真面目的誘餌，與但丁、尼祿、蕾蒂聯手解決魔劍教團事件。")]
let 蕾蒂 = [CerData(name: "蕾蒂", data: "本名瑪麗（Mary），《惡魔獵人3》的女主角。但因為對父親的憎恨而排斥瑪麗這個名字，因為但丁用蕾蒂來稱呼她，最後改用蕾蒂稱呼自己。武器有各種槍械，但主要武器是一把跟她身高差不多的多功能火箭炮。")]
let V = [CerData(name: "V", data: "《惡魔獵人5》的男主角，全身刺青，拄著拐杖的黑髮青年。但丁和尼祿的委託人，登場時引用手上拿著的書威廉·布萊克的詩「地獄的箴言」的其中一小段：有欲望而無行動者滋生瘟疫。故事中向翠絲說明自己是維吉爾為了打敗但丁而使用闇魔刀（Yamato）分離出來的人性面。是位魔獸使，能夠使役魔獸「暗影」、「格里芬」和「夢魘」來進行戰鬥。")]
let 斯巴達 = [CerData(name: "斯巴達", data: "但丁與維吉爾的父親，曾是魔帝的軍師，但與魔帝意見不合，雙方爆發了神魔戰爭，將魔帝封印起來後成為魔界的領主，被譽為「最強的魔劍士」、「魔劍士斯巴達」等諸多異名。")]
let 露西亞 = [CerData(name: "露西亞", data: "《惡魔獵人2》的女主角，也是《惡魔獵人2》的可控角色。名字源自神曲中。露西亞是亞歷烏斯製造的惡魔，後期才知道自己的真實身分，現在是「守護之手」之繼承人。")]
let 伊娃 = [CerData(name: "伊娃", data: "但丁與維吉爾的母親，是一名人類（在《DmC：惡魔獵人》中則是天使）。為救但丁及尋找維吉爾而被惡魔所殺。")]
let 妮可蕾塔·戈德斯坦 = [CerData(name: "妮可蕾塔·戈德斯坦", data: "《惡魔獵人5》的女主角，與尼祿一同行動，自稱「兵器藝術家」，其祖母曾為還是以東尼·雷德格瑞夫（Tony Redgrave）為名的但丁製作及設計其招牌雙槍武器「黑檀與象牙」——武器職人尼爾·戈德斯坦（Nell Goldstein）。她為獨臂的尼祿打造了對惡魔用義手型兵裝—「破魔者」（Devil Breaker），以不惜犧牲耐久性也要加入的自創結構設計為榮。對自己的作品有著絕對的自信，且有身為4代瘋狂科學家亞格納斯（Agnus）的女兒的影子。")]
let 魔帝穆圖斯 = [CerData(name: "魔帝穆圖斯", data: "魔界的統治者。《惡魔獵人》的主要敵人。本來在兩千年前與但丁的父親斯巴達交戰最後不敵斯巴達的力量而被封印起來，他趁著斯巴達的封印減弱時，突破封印並在馬列特島上聚集自己的惡魔軍團，準備再次入侵人間；但最後敗於但丁手下，而再次被封印。")]
let 霸王阿哥薩克斯 = [CerData(name: "霸王阿哥薩克斯", data: "魔界的霸王。曾擁有魔界的大半，使眾多惡魔屈服的混沌霸王，自從敗給了斯巴達後一直在等待復活的時機，具有各種惡魔的外形及能力。擁有男女兩性的完美容貌，由於具有不可侵犯的威嚴，所以常被尊崇為「神」，但其本質卻是極端的絕望。")]
let 阿卡姆 = [CerData(name: "阿卡姆", data: "《惡魔獵人3》中的反派之一。阿卡姆是蕾蒂的父親，因專研黑魔術而親手殺了自己的妻子，變成了惡魔，也因此造成蕾蒂對他的憎恨。故事中為了得到斯巴達（即但丁與維吉爾之父）的力量，表面上與維吉爾合作，但實際上是為了利用他。雖然最後阿卡姆得到斯巴達的力量，卻還是敗給但丁與維吉爾。")]
let 亞歷烏斯 = [CerData(name: "亞歷烏斯", data: "《惡魔獵人2》中的主要對手。亞歷烏斯表面為國際企業之總裁，對於宗教及古代魔術文化有深入的研究。為了得到邪神的力量而進行召換的儀式，但最後被但丁阻止而失敗。")]
let 帕蒂·洛厄爾 = [CerData(name: "帕蒂·洛厄爾", data: "動畫版登場的女主角，是一名小女孩。是把大惡魔阿比蓋爾封印的魔道士艾倫·洛厄爾的後裔。保管住祖先留下用來封印阿比蓋爾的魔石艾倫之涙而被惡魔追殺，事件解決後與母親團聚。5代中為了邀請但丁參加自己的18歲生日派對而打了多次電話給他，僅聲音登場。")]
let 姬莉葉 = [CerData(name: "姬莉葉", data: "《惡魔獵人4》角色。克雷多的妹妹，在魔劍教團舉行「魔劍祭」時擔任歌姬。姬莉葉與舉目無親的尼祿如同家人般一同生活，對尼祿來說是個如姊如母般的角色。後期姬莉葉因為在一連串的陰謀中知道尼祿對自己的心意，到結局時已經接受了尼祿的愛，正式表明了兩人的關係。5代中僅聲音登場。")]
let 克雷多 = [CerData(name: "克雷多", data: "《惡魔獵人4》角色。克雷多是魔劍教團的「聖騎士」團長，性格嚴肅公正，具備高超的劍術與統領數百名部下的統馭力。克雷多經過魔劍教團中的「歸天儀式」令他自身能夠魔人化，變成隻翼天使。在尼祿正要回總部調查教團的真正目的途中出現，試圖阻止尼祿。後來被他打敗，從中得知教團一直在利用自己及妹妹。之後在教團總部的救世主面前，為了救出被抓住的尼祿，而被教皇用閻魔刀刺穿腹部，最後在但丁答應他的請求(救出尼祿跟姬莉葉)之後，因傷勢過重而死，消失在一陣光芒之中。克雷多與妹妹姬莉葉一樣把尼祿當成親人，不過也因為尼祿經常違抗命令、任意行動而感到煩惱。")]
let 亞格納斯 = [CerData(name: "亞格納斯", data: "《惡魔獵人4》中初次登場。亞格納斯是魔劍教團技術局局長，負責開發對抗惡魔的技術與武器，他的個性極度的陰沉而狡猾而且說話時常口吃。他亦經過了教團中的「歸天儀式」，令自身能夠魔人化，變成隻眼天使，並擁有一副蒼蠅的姿態。聖騎士成員的佩劍「石中劍」、「聖殿鎧甲」等高階惡魔皆是出自他手，甚至還創造出魔界之門的複製品，並與魔劍教皇密謀開發了偽裝成「真神」的巨大惡魔。亞格納斯很少出席教團活動，教團中知道他存在的人並不多，最後被但丁一槍擊斃。在《惡魔獵人5》中的妮可，已確認是他的親生女兒。")]
let 馬蒂爾 = [CerData(name: "馬蒂爾", data: "《惡魔獵人2》角色。露西亞名義上的母親。曾經與斯巴達共同作戰過，有著「守護之手」的稱號。在5代小說有客串。")]
let 莫里森 = [CerData(name: "莫里森", data: "動畫版及《惡魔獵人5》角色。情報販子，一身紳士打扮。擔任V和但丁的中介。動畫版是金髮白人, 5代卻是黑人。是目前還沒清楚解答的設定疑惑。")]
